{
  "tutorial": {
    "introduction": "In the heart of the bustling city, Purrlock Holmes faces his first challenge: Mrs. Calico's prized milk saucer has vanished. Purrlock sets out to crack the case and prove himself as a budding detective",
    "puzzles": [
      {
        "name": "The Case of the Missing Saucer",
        "id": "0001",
        "description": "Mrs Calico’s prized milk saucer has gone missing! Can you recover it and uncover the thief?",
        "story": "Purrlock Holmes has received a frantic call from the beloved Mrs Calico. Her prized milk saucer has vanished! The only clue is a strange note left behind with scrambled letters, in place of the item. Purrlock must use his knowledge of ciphers to decipher the note and identify the thief.",
        "solution": "Surprise! Happy Birthday Detective Purrlock Holmes!",
        "jumble": "",
        "cipher": ["caesar"]
      }
    ],
    "conclusion": "With the success of Purrlock’s first case, director Caperton Capybaraton promoted Purrlock to Detective. Purrlock was very proud; he spent most of his kittenhood dreaming of this moment. He was very eager for his first big case. Lucky for him, one was just about to land on his desk."
  },
  "easy": {
    "introduction": "A series of cat-themed burglaries have left the city in disarray. Can Purrlock find the culprit and return peace to the city?",
    "puzzles": [
      {
        "name": "The Riddle of the Sphinx",
        "id": "0002",
        "description": "The Sphinx has gone missing from an exhibit in the Museum of Feline Antiquities, leaving a mysterious cipher in its place. Can you follow the clues to uncover this mystery?",
        "story": "A series of cat-themed burglaries has left the city in disarray. The latest burglary is at the Museum of Feline Antiquities. Purrlock has been assigned the case. The beloved Sphinx is missing, and in its place a riddle has been written among the sand. Purrlock must carefully solve this puzzle without disturbing the sand.",
        "solution": "Fifth column. Volcano. Push on right side of the column.",
        "jumble": "",
        "cipher": ["emoji"]
      },
      {
        "name": "The Labyrinth of Loops",
        "id": "0003",
        "description": "Can you make it out of the labyrinth?",
        "story": "Purrlock followed the clue from the sphinx and discovered a set of sandy paw prints leading to a secret passage. This passageway led him down to a circular room, deep below the museum. This room contained several doorways. After cautiously trying out a few doorways, Purrlock found himself back in the circular room. The walls of this room were covered in strange symbols. Navigating the maze requires decoding the symbols to find the correct path.",
        "solution": "Follow the path: NNW, W, NE, S, SE, SW, S, E, SSE, SE, E.",
        "jumble": "",
        "cipher": ["morse"]
      },
      {
        "name": "The Cat Burglar Unmasked",
        "id": "0004",
        "description": "Can you solve the final puzzle to uncover the identity of the Cat Burglar, and put a stop to their thievery once and for all?",
        "story": "After making his way through the maze, Purrlock found the hidden lair of the Cat Burglar. The Burglar was not to be found, likely out on the prowl, committing their next crime. In a strange way, the lair was not all that unlike his own office. There even was a corkboard behind the desk, undoubtedly used to figure out where to commit thievery next. Purrlock looked more closely at the corkboard. The plans were all written in cipher. Purrlock would need to solve the cipher on the corkboard to uncover the location of the next crime and to reveal the identity of the thief.",
        "solution": "Next target is the purrised necklace at Lady Ragdoll's estate.",
        "jumble": "",
        "cipher": ["binary"]
      }
    ],
    "conclusion": "With the location of the Cat Burglar's next target, Purrlock immediately called the pawlice, who caught the thief red-pawed. The Cat Burglar never expected anyone to be clever enough to figure out the ciphers, and left them to tease the cops with false hope. Purrlock had once again proved his prowess. But little did he know, this was only the beginning."
  },
  "medium": {
    "introduction": "A mysterious figure commonly known as the Whiskered Phantom has been leaving cryptic messages throughout the city. Can Purrlock uncover the identity of the purrpetrator?",
    "puzzles": [
      {
        "name": "The Whiskered Phantom",
        "id": "0005",
        "description": "Purrlock has received a mysterious seemingly blank piece of paper, smelling faintly of lemon. Could this be relevant to the mysterious cryptic messages being spread around the city?",
        "story": "A mysterious figure known as the Whiskered Phantom is leaving cryptic messages throughout the city. Purrlock has received a seemingly blank piece of paper, slotted through the mail slot of his front door. He noticed a faint hint of lemon wafting from the page, and using a heat-sensitive ink reveal technique, a message written in cipher appeared.",
        "solution": "Nearest alleyway to fifth Bombay St.",
        "jumble": "",
        "cipher": ["polybius"]
      },
      {
        "name": "The Enigma of the Alley Cats",
        "id": "0006",
        "description": "Down an alleyway in the heart of the city, a group of alleycats meow strangely at Purrlock. Is this just random, or is there a hidden meaning among the noise?",
        "story": "The letter led Purrlock down an alleyway in the heart of the city. As he entered, he was greeted by a group of alley cats meowing at him. At first their meows seemed nonsensical. Realising it's an encoded message, Purrlock must decipher their communication to find the next clue.",
        "solution": "Sewers! 5 steps, left, 15 steps, right, follow the passageway.",
        "jumble": "",
        "cipher": ["binary"]
      },
      {
        "name": "The Mysterious Golden Door",
        "id": "0007",
        "description": "Following the clues, Purrlock finds himself in the sewers in front of a mysterious golden door. Can you figure out how to open it?",
        "story": "The message from the alleycats revealed a secret temple within the sewers. Purrlock tried to make his way to this hidden temple, but found his way blocked by what he initially thought was a grimy wall. After noticing a strange glint, he used his claws to scrape away some of the grime, and found gold underneath, to great contrast with the rest of the sewer. Scrunching up his face, he begrudgingly used his handkerchief and nearby sewer water to clean off the door. This revealed a series of riddles, as well as many buttons, levers and other strange contraptions on a mysterious golden door. He must solve the riddles to open the door.",
        "solution": "Up, up, down, down. Left, right, left, right. B, A, Start.",
        "jumble": "",
        "cipher": ["morse"]
      },
      {
        "name": "The Phantom Temple",
        "id": "0008",
        "description": "Down, down, far below the city lies a strange temple. What secrets hide there?",
        "story": "Purrlock opened the golden door and followed the path downwards. At the end, a grand temple was revealed. Crumbling statues lined the walls, plants reached down from the ceiling. Purrlock deduced that this temple has been here for a long time. In front of lines of chairs in the middle lay a sacrificial altar. A fresh kill was left atop the altar, surrounded by carved bones, fur, and other offerings. Purrlock heard the sound of a distant rock fall, followed by the flicker of a shadow in his purriferal vision. He felt a presence that would not reveal itself. His fur prickled on end. He looked back towards the altar, and noticed a small slip of paper with a complex cipher written on it. Would this give any answers of which Purrlock was seeking?",
        "solution": "Paws prowl, tails weave, Speak the truth, if you believe.",
        "jumble": "",
        "cipher": ["caesar"]
      },
      {
        "name": "The Cult of the Whiskered Phantom",
        "id": "0009",
        "description": "Time for a showdown against the Whiskered Phantom!",
        "story": "Purrlock spoke the solved note aloud. The words slipped strangely off his hooked tongue. He looked up to find that he was no longer alone, instead being surrounded by the very alley cats that lead him here. He looks back at the altar, and with horror he realises that the fresh kill on the altar is the corpse of a very mangled cat. This was much more dangerous than Purrlock expected, or had ever encountered before! A particularly large ginger cat stepped forward, his coat washed in some strange, sticky liquid. He welcomed Purrlock with his scratchy voice, then proceeded to challenge him in a challenge of wits, in order to appease their master. ",
        "solution": "Beware the silent watcher, for even shadows have eyes.",
        "jumble": "",
        "cipher": ["vigenere"]
      }
    ],
    "conclusion": "With Purrlock’s victory, the alley cats retreated back into the darkness, as quickly as they appeared, as if they were never there. Purrlock investigated the temple further, to no avail. The alley cats were the source of the mysterious cryptic messages around the city, but it would seem that they were merely a cult surrounding a yet more mysterious figure. Their master. But with no new leads, Purrlock had to move on for now."
  },
  "hard": {
    "introduction": "Since the case of the Whiskered Phantom, crime has been on the rise. Puzzles are graffitied on the streets, civilians murdered in their sheets. Purrlock has a feeling that this is all linked to the mysterious master, but nothing so far he has found has linked to this master, except the occasional crazed criminal mentioning a master of some sort. Purrlock solves many cases, becoming known as the greatest detective in the 9 realms, yet he feels that he is missing something, and a storm is on the horizon.",
    "puzzles": [
      {
        "name": "You’ve Got Mail!",
        "id": "0010",
        "description": "Purrlock receives a mysterious letter in his mailbox, containing a jumbled message. Can you solve the cipher?",
        "story": "One fateful day as Purrlock arrived home, he found a mysterious letter left in his mailbox, with the inscription 'For my favourite archenemy ;)' upon the envelope. He looked around, but saw nothing out of the ordinary. He carefully entered his home. When no threats revealed themselves, he slowly opened the letter. Inside was a message, written in what looks like jumbled garbage. He must complete the cipher to read what it says.",
        "solution": "Find me, Purrlock! A34, F23, I81, D74 and J27.",
        "jumble": "",
        "cipher": ["morse"]
      },
      {
        "name": "Hidden Patterns",
        "id": "0011",
        "description": "Purrlock is told to look at the evidence from recent crimes. Can he find the connection between them to find the root of corruption within the city?",
        "story": "The letter told Purrlock to look at evidence from a list of recent cases, all with seemingly no link. After looking closer at the files of these cases, he noticed a pattern in what is graffitied on the wall at each crime scene. Upon matching up these images to create a shape, he noticed that it results in a cipher.",
        "solution": "21 Furr Ave, 1:03am. Don't be late!",
        "jumble": "",
        "cipher": ["binary"]
      },
      {
        "name": "Criminal Framework",
        "id": "0012",
        "description": "Purrlock has been framed! Can you prove his innocence and find the next clue to find the purrpetrator behind this?",
        "story": "The graffiti cipher gave him a time and place. 221C Biscuit Street, 2am the next day. He arrived at the location at the given time. He knocked at the door. No response. He paused, thinking for a moment. Curious, he tried the door handle. Unlocked. Folding his ears upon his head, he slowly stepped inside. \nIt was a modest apartment, with only a few rooms: a bathroom, kitchen-living area and a bedroom. He looked around, noticing a peculiar piece of paper on the floor. Before he could check it, he heard a knocking on the door. It was the pawlice. Purrlock was startled. Before he could compose himself and respond, a heavy thud shook the building as the door was knocked down. \nAs Purrlock tried to explain and ask what was going on, he was arrested. As he was dragged away, he spied the pawlice knock open a hidden compartment behind the fireplace to reveal a stash of catnip. Purrlock realised the pawlice must have had an anonymouse tip. \nPurrlock was arrested for smuggling illegal catnip. Caperton knew that, despite Purrlock’s history of catnip abuse, that Purrlock would not do such a thing, and sent another detective to gather evidence for Purrlock. This detective returned with the mysterious pieces of paper that they found around the house, as well as pictures of strange symbols on the walls. With this evidence, Purrlock must solve the ciphers to prove his innocence, and prove that he was investigating a different case, as well as finding the next clue to reveal the identity of the master.",
        "solution": "Catnip hidden. Letter planted. Delivery of cheese to 33 Whisker Dr.",
        "jumble": "",
        "cipher": ["binary"]
      },
      {
        "name": "The Mansion of Doom",
        "id": "0013",
        "description": "With the location of the criminal mastermind, Purrlock must now find a way into the lair to confront them once and for all.",
        "story": "Purrlock now had the location of the master’s lair. With the location clocked into his GPS, Purrlock headed off right away. The route took him right into the heart of the city, to the mysterious, haunted, abandoned mansion. While the public always wanted the house to get hauled away to make space for something better for the community, the council always seemed to ignore these requests, never making a comment on the building, completely avoiding all mention of it.\nClouds closed in, blanketing the sky in grey fluff. Purrlock’s fur prickled; a mighty storm was approaching. As he stepped out of his car, Purrlock drew his flashlight. He jumped over the crumbling brick outer walls and into the front yard. Weeds ran wild, almost completely obscuring the footpath. He looked up. The door was slightly ajar, as if taunting him to enter. Purrlock found his curious feet walk up the stairs, across the porch, and finally enter the building.\nThe interior, still proud despite its wear, was surprisingly well kept. Something, or someone, had been preventing ramsackers from ruining this place. The mysterious master, no doubt. As he explored each room, Purrlock found that the rest of the house was also tidy, with the exception of crazed symbols decorating the walls. Each room seemed to have a different cipher. \nAfter checking the ground floor and upstairs, Purrlock approached the basement. Purrlock, an avid reader and puzzle solver, was well aware that the basement would be where the climax of this case would occur. Surely the master could not resist a good clique, after all. Walking down the stairs, he came to a large set of locked doors, with a final hint on how to combine the ciphers from around the house.",
        "solution": "The door is already unlocked you silly goose!",
        "jumble": "",
        "cipher": ["binary"]
      },
      {
        "name": "There’s a Mouse in my House!",
        "id": "0014",
        "description": "Purrlock has finally tracked the real Whiskered Phantom to his lair. It is time to confront Purrlock’s archenemy and put an end to his scheming ways for good!",
        "story": "As he finished inputting the final solution, Purrlock jumped as thunder roared down the stoney staircase. The doors creaked open, to reveal none other than Keith. Keith shot a piercing gaze from his blood red eyes at Purrlock and rose on his back legs, revealing his greatest invention: the cipher gun. Locked and loaded with ciphers a-plenty.",
        "solution": "Did you know there are over 2000 variants of cheese?",
        "jumble": "",
        "cipher": ["morse"]
      }
    ],
    "conclusion": "Keith shot puzzle after puzzle at Purrlock. As Purrlock solved each one, he noticed a pattern with the solutions!. A secret backstory, tragic beyond measure! A tragic childhood. Alone. Bored. Ignored. He read many books, learning about puzzles and becoming a master at them, being able to solve any that was sent his way. But young Keith never solved the puzzle of how to make a true friend. A puzzle it seemed that he felt all but him solved with ease. Everybody that he thought he made friends with abandoned him eventually, left him behind, leaving him alone. People used him. Hurt him. He vowed to find one as clever as him. He became the manipulator, creating the cult of alley cats to help him with his evil deeds, and to find the one clever enough to be a true archenemy. No one else could solve his puzzles. Until Purrlock. Purrlock is the chosen one!!! The one he can play with!!! Muahaha.\nWith this new knowledge, Purrlock chatted to Keith, who collapsed into tears. Of course, Purrlock had to take Keith in, as Keith was a criminal. But first, Purrlock brought Keith to couples therapy, and the two bonded. They become besties. Purrlock made sure that Keith went to a prison focused on rehabilitation, and often made visits to check up on him. Eventually Keith became Purrlock’s detective partner, and between the two of them, they became the best detectives in the entire world, able to solve any mystery, any puzzle. Partners in crime!"
  }
}
